_posts/2016-07-23-haskell-vs-practical-languages.html
---
layout: post
title: Haskell vs. practical languages
excerpt: Why are languages favored by academics wildly unpopular in industry?
---

<p>
The <a href="https://www.coursera.org/learn/progfun1">Functional Programming in Scala</a> course I'm taking from Coursera has stimulated a (renewed) interest in <i>Haskell</i>.
</p>

<p>
For lovers of functional programming, Haskell is the language other functional languages aspire to&#x2013;uncompromising in its commitment to purity , pursuing fundamental ideas instead of following trends, and actively developed by the smartest functional programmers and academics around.
</p>

<p>
As an introduction to Haskell, I'm reading the popular <a href="http://learnyouahaskell.com/chapters">Learn You a Haskell for Great Good!</a>, a "gentle" introduction to functional programming in general and Haskell in particular. As with all "gentle" introductions, the book avoids theoretical topics in favor of illustrations, code examples, and grab-bags of useful library functions.
</p>

<p>
This is fine with me, because my intention is not to <i>write</i> Haskell programs, but to be able to <i>read</i> them fluently&#x2013;a much easier task, as any student of foreign languages would agree.
</p>

<p>
Haskell is a trend-setter, much like Lisp, which is perhaps why other languages and communities look up to it. New ideas in functional programming tend to be implemented first in Haskell by the academics and hackers that invent them. If the ideas are judged worthy by the Haskell community, it becomes broadly adopted, and slowly filters outward to other functional language communities over time. <a href="http://www.scala-lang.org/">Scala</a> is very much inspired by Haskell; even some of its syntax is similar. <a href="https://clojure.org/">Clojure</a>, in turn, took many ideas from Scala, and a few directly from Haskell itself.
</p>

<p>
Why, then, is Haskell not popular with programmers "in general"?
</p>

<p>
There are a few possible answers:
</p>

<ul class="org-ul">
<li>Most programmers first learn to code imperatively, then move on to object-oriented languages. Being forced to <i>think</i> in a purely functional style is frustrating, and most never move beyond the initial frustration.
</li>
<li>Functional programming in general contains many new words unfamiliar to most programmers; Haskell kicks this up to 11 by embracing terms like <b>monad</b> and <b>functor</b>.
</li>
<li>The Haskell community is full of very smart people, which, intentionally <i>and</i> unintentionally, creates cultural barriers to outsiders.
<ul class="org-ul">
<li>As with many technical communities, there are newly minted amateurs who see themselves as "gatekeepers", whose responsibility is to "weed out" newbies with claims such as "You <i>must</i> know category theory to understand Haskell"<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</li>
</ul>
</li>
<li>Haskell's strengths, like a powerful type system, do not necessarily address "real-world needs", which mostly involve hacking into the software to address the latest ridiculous user demand.
<ul class="org-ul">
<li>This perhaps explains the victory of dynamic languages in the language wars of the 1990's.
</li>
</ul>
</li>
</ul>

<p>
If I could compare Haskell to anything, it'd be Latin&#x2013;something all who claim to be educated (in functional programming) should have a working knowledge of, but which few will use in their jobs.
</p>

<p>
In summary: learn Haskell (or ML, or some other "academic" language) to expand your way of thinking. It's sure to do so.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
As a math major, I responded by watching <a href="https://www.youtube.com/watch?v=BF6kHD1DAeU&list=PLGCr8P_YncjVjwAxrifKgcQYtbZ3zuPlb">lectures on category theory</a> by Steve Adowey. While enlightening, it reinforced my initial assumption that the theoretical stuff is not really necessary to "understand Haskell".
</p></div>


</div>
</div>
